local alpha = require("alpha")
local theta = require("alpha.themes.theta")

theta.config.layout[2].val = {
  "                                                     ",
  "  ███╗   ██╗███████╗ ██████╗ ██╗   ██╗██╗███╗   ███╗",
  "  ████╗  ██║██╔════╝██╔═══██╗██║   ██║██║████╗ ████║",
  "  ██╔██╗ ██║█████╗  ██║   ██║██║   ██║██║██╔████╔██║",
  "  ██║╚██╗██║██╔══╝  ██║   ██║╚██╗ ██╔╝██║██║╚██╔╝██║",
  "  ██║ ╚████║███████╗╚██████╔╝ ╚████╔╝ ██║██║ ╚═╝ ██║",
  "  ╚═╝  ╚═══╝╚══════╝ ╚═════╝   ╚═══╝  ╚═╝╚═╝     ╚═╝",
  "                                                     ",
}

local buttons = require("alpha.themes.dashboard").button
theta.config.layout[6].val = {
  buttons("s", "  restore session",  function() require("persistence").load() end),
  buttons("f", "  find file",        "<cmd>FzfLua files<cr>"),
  buttons("r", "  recent files",     "<cmd>FzfLua oldfiles<cr>"),
  buttons("g", "  live grep",        "<cmd>FzfLua live_grep<cr>"),
  buttons("q", "  quit",             "<cmd>qa<cr>"),
}

alpha.setup(theta.config)
